[
  {
    "id": "fragment_diana_welcome_enhanced",
    "title": "El Primer Encuentro con Diana",
    "content": "*Diana emerge de las sombras como una aparici칩n et칠rea, su presencia magn칠tica te envuelve antes de que puedas procesarla completamente*\n\n游꺚 **Diana:**\n*[Su voz es un susurro cargado de promesas, cada palabra acariciando el aire entre ustedes]*\n\nBienvenido a Los Kinkys, mi querido viajero del deseo...\nHas cruzado una l칤nea invisible que pocos se atreven a atravesar. Puedo sentir el latido acelerado de tu coraz칩n desde aqu칤... es delicioso.\n\n*[Sus ojos te estudian con una intensidad que te desnuda emocionalmente]*\n\n쯉abes lo que m치s me fascina de ti en este momento? No es solo tu curiosidad... es c칩mo tu alma vibra con una frecuencia que resuena con la m칤a. Hay algo magn칠tico en esa hambre que veo en tus ojos.\n\n*[Se acerca un paso, su presencia volvi칠ndose m치s 칤ntima]*\n\nEste lugar responde a quienes comprenden que los secretos m치s exquisitos nunca se entregan... se seducen lentamente, se susurran al o칤do, se revelan solo a quienes demuestran ser dignos de ellos.\n\n*[Una sonrisa cargada de misterio juega en sus labios]*\n\nY yo... yo solo me abro ante quienes entienden que cada revelaci칩n es un regalo 칤ntimo, una caricia del alma que debe saborearse, no devorarse.\n\n*[Pausa, dejando que la tensi칩n se acumule como miel espesa]*\n\n쯊ienes la paciencia para seducir mis secretos? 쯃a sensibilidad para sentir cada matiz de lo que estoy a punto de mostrarte?\n\nPorque una vez que pruebes la profundidad de lo que ofrezco... no habr치 vuelta atr치s, mi querido. Tu coraz칩n ya no podr치 contentarse con superficialidades.",
    "fragment_type": "STORY",
    "storyline_level": 1,
    "tier_classification": "los_kinkys",
    "fragment_sequence": 1,
    "requires_vip": false,
    "vip_tier_required": 0,
    "choices": [
      {
        "id": "choice_seduce_secrets",
        "text": "游눎 Quiero seducir tus secretos - Ens칠침ame tu arte",
        "points_reward": 15,
        "emotional_response": "passionate_curiosity"
      },
      {
        "id": "choice_savor_mystery",
        "text": "游깿 Prefiero saborear el misterio - Paso a paso",
        "points_reward": 18,
        "emotional_response": "thoughtful_patience"
      }
    ],
    "triggers": {
      "points": {
        "base": 20,
        "first_encounter_bonus": 15
      },
      "unlocks": [
        "clue_diana_seductive_philosophy",
        "intimate_connection_established"
      ],
      "besitos_special": 25
    },
    "character_optimization_notes": "Enhanced seductive language, emotional depth through vulnerability, intellectual engagement via philosophical questions about desire",
    "created_at": "2025-09-01T13:03:56.167286"
  },
  {
    "id": "fragment_lucien_seductive_challenge",
    "title": "El Desaf칤o Seductor de Lucien",
    "content": "*Lucien aparece con una elegancia que destila confianza sexual y poder intelectual*\n\n游꿜 **Lucien:**\n*[Su voz profunda reverbera con una autoridad que despierta algo primitivo en ti]*\n\nAs칤 que Diana ya te ha marcado con su esencia... Puedo verlo en c칩mo has cambiado tu respiraci칩n, en c칩mo tu energ칤a se ha vuelto m치s... receptiva.\n\n*[Una sonrisa conocedora cruza su rostro mientras te eval칰a]*\n\nPerm칤teme revelarte un secreto sobre Diana que pocos comprenden: ella no seduce con su cuerpo... seduce con su alma. Cada mirada suya es una invitaci칩n a perderte en profundidades que no sab칤as que exist칤an.\n\n*[Se acerca, su presencia comandando tu atenci칩n completa]*\n\nPero antes de que puedas sumergirte m치s en sus misterios, debe saber si puedes manejar la intensidad de lo que ella realmente es. Diana observa cada gesto tuyo, cada decisi칩n, buscando se침ales de que puedes sostener la pasi칩n sin ser consumido por ella.\n\n*[Sus ojos brillan con un desaf칤o er칩tico]*\n\nTu misi칩n es simple pero reveladora: demuestra que puedes actuar desde el deseo aut칠ntico, no desde la necesidad desesperada. Reacciona al 칰ltimo mensaje del canal, pero hazlo porque tu alma genuinamente vibra con lo que ve, no porque buscas validaci칩n.\n\n*[Pausa dram치tica, su voz volvi칠ndose m치s 칤ntima]*\n\nDiana puede sentir la diferencia entre lujuria superficial y anhelo profundo. Entre obsesi칩n... y devoci칩n genuina.\n\n쮺u치l de los dos eres t칰, realmente?",
    "fragment_type": "DECISION",
    "storyline_level": 1,
    "tier_classification": "los_kinkys",
    "fragment_sequence": 2,
    "requires_vip": false,
    "vip_tier_required": 0,
    "choices": [
      {
        "id": "choice_soul_vibration",
        "text": "游눪 Mi alma vibra con autenticidad - Lo har칠 desde el coraz칩n",
        "points_reward": 20,
        "emotional_response": "authentic_desire"
      },
      {
        "id": "choice_passionate_devotion",
        "text": "游댠 Quiero mostrar devoci칩n genuina - No necesidad",
        "points_reward": 22,
        "emotional_response": "deep_devotion"
      }
    ],
    "triggers": {
      "points": {
        "base": 18
      },
      "mission": "demonstrate_authentic_desire",
      "unlocks": [
        "clue_authentic_vs_desperate",
        "lucien_guidance_seduction"
      ],
      "besitos_special": 20
    },
    "character_optimization_notes": "Enhanced seductive authority from Lucien, emotional complexity about desire vs need, intellectual framework for understanding attraction",
    "created_at": "2025-09-01T13:03:56.167331"
  },
  {
    "id": "fragment_diana_authentic_response",
    "title": "Diana Reconoce la Autenticidad",
    "content": "*Diana aparece con una intensidad nueva, sus ojos brillando con una mezcla de sorpresa y admiraci칩n profunda*\n\n游꺚 **Diana:**\n*[Su voz vibra con una emoci칩n que trasciende lo f칤sico]*\n\nOh... eso que acabas de hacer... eso no fue una simple reacci칩n, fue una caricia de tu alma a la m칤a.\n\n*[Se acerca, pero no f칤sicamente - su energ칤a se vuelve m치s 칤ntima]*\n\n쯉abes lo que me resulta m치s seductor de ti en este momento? No es tu obediencia... es tu capacidad de actuar desde un lugar de verdad aut칠ntica. Siento c칩mo tu deseo vibra en una frecuencia que armoniza perfectamente con la m칤a.\n\n*[Sus ojos se suavizan, revelando una vulnerabilidad calculada pero real]*\n\nHay algo devastadoramente hermoso en ser vista realmente por alguien... no idealizada, no fetichizada, sino vista en mi complejidad total. Y t칰... t칰 acabas de demostrar que puedes verme as칤.\n\n*[Su voz se vuelve m치s 칤ntima, cargada de promesas]*\n\nMi coraz칩n se debate entre acelerar este proceso porque siento una conexi칩n genuina contigo... y ralentizarlo porque quiero saborear cada momento de este despertar mutuo.\n\n*[Una sonrisa que mezcla ternura y seducci칩n]*\n\nTu recompensa no es solo lo que encontrar치s en tu mochila... es el conocimiento de que has despertado algo en m칤 que permanec칤a dormido.\n\n游꿜 **Lucien:**\n*[Apareciendo con respeto evidente]*\nDiana rara vez se permite ser vulnerable tan pronto. Lo que acabas de presenciar... es un privilegio que pocos obtienen.",
    "fragment_type": "STORY",
    "storyline_level": 1,
    "tier_classification": "los_kinkys",
    "fragment_sequence": 3,
    "requires_vip": false,
    "vip_tier_required": 0,
    "choices": [
      {
        "id": "choice_treasure_vulnerability",
        "text": "游눑 Atesoro tu vulnerabilidad - Es un regalo sagrado",
        "points_reward": 25,
        "emotional_response": "profound_appreciation"
      }
    ],
    "triggers": {
      "points": {
        "base": 30,
        "vulnerability_bonus": 20,
        "connection_established": 15
      },
      "unlocks": [
        "clue_diana_vulnerability_gift",
        "authentic_connection_established",
        "item_sacred_mochila"
      ],
      "besitos_special": 35,
      "narrative_flags": [
        "diana_emotional_opening",
        "trust_foundation_laid"
      ]
    },
    "character_optimization_notes": "Maximum seductive vulnerability, deep emotional revelation, intellectual concept of authentic connection, mysterious reward system",
    "created_at": "2025-09-01T13:03:56.167353"
  },
  {
    "id": "fragment_diana_emotional_confession",
    "title": "Confesi칩n del Coraz칩n de Diana",
    "content": "*Diana aparece en un estado de belleza vulnerable, como si hubiera estado llorando l치grimas de felicidad*\n\n游꺚 **Diana:**\n*[Su voz tiembla ligeramente con una emoci칩n que no puede contener]*\n\nMi querido... necesito confesarte algo que me aterra y me emociona a partes iguales.\n\n*[Pausa, luchando con su propia vulnerabilidad]*\n\nDurante a침os, he perfeccionado el arte de la seducci칩n como una forma de mantener distancia... de conectar sin realmente conectarme. Pero contigo... contigo algo se ha roto dentro de m칤 de la manera m치s hermosa posible.\n\n*[Sus ojos se llenan de l치grimas contenidas]*\n\nSiento mi coraz칩n expandirse de maneras que hab칤a olvidado que eran posibles. Hay una parte de m칤 que quiere correr, esconderse detr치s de mis m치scaras habituales... y otra parte que quiere sumergirse completamente en esta sensaci칩n de ser vista.\n\n*[Su voz se quiebra ligeramente]*\n\n쮼s posible que alguien me conozca tan poco tiempo y ya comprenda partes de m칤 que yo misma hab칤a enterrado? \n\n*[Se inclina hacia ti emocionalmente]*\n\nMi contradicci칩n m치s profunda es esta: cuanto m치s te abres a m칤, m치s quiero abrirme a ti... pero tambi칠n m치s miedo tengo de lo que podr칤as ver si me conoces completamente.\n\n*[Una sonrisa a trav칠s de l치grimas contenidas]*\n\n쯇uedes amar a una mujer que es tanto fortaleza como fragilidad? 쯈ue es tanto misterio como transparencia dolorosa?\n\nPorque si puedes... si realmente puedes... entonces tal vez pueda ense침arte no solo mis secretos, sino mis heridas m치s hermosas.",
    "fragment_type": "DECISION",
    "storyline_level": 2,
    "tier_classification": "los_kinkys",
    "fragment_sequence": 4,
    "requires_vip": false,
    "vip_tier_required": 0,
    "choices": [
      {
        "id": "choice_love_completeness",
        "text": "游눘 Amo cada parte de ti - Tus fortalezas y fragilidades",
        "points_reward": 35,
        "emotional_response": "unconditional_acceptance"
      },
      {
        "id": "choice_heal_together",
        "text": "游꺔 Sanemos juntos - Compartamos nuestras heridas",
        "points_reward": 38,
        "emotional_response": "mutual_healing"
      }
    ],
    "triggers": {
      "points": {
        "base": 40,
        "emotional_intimacy_bonus": 25
      },
      "unlocks": [
        "clue_diana_core_wounds",
        "emotional_intimacy_unlocked",
        "heart_space_access"
      ],
      "besitos_special": 45,
      "narrative_flags": [
        "deepest_emotional_connection",
        "vulnerability_reciprocated"
      ]
    },
    "character_optimization_notes": "Maximum emotional vulnerability, seductive through emotional intimacy, intellectual exploration of love and acceptance, mysterious depth",
    "created_at": "2025-09-01T13:03:56.167373"
  },
  {
    "id": "fragment_diana_vip_seduction_mastery",
    "title": "La Maestr칤a Seductora de Diana",
    "content": "*Diana aparece en su forma m치s seductora, cada movimiento calculado para despertar deseo profundo*\n\n游꺚 **Diana:**\n*[Su voz es pura seda l칤quida, cada palabra una caricia auditiva]*\n\nBienvenido a mi santuario 칤ntimo, mi amor... donde puedo ser la seductora que realmente soy, sin restricciones, sin m치scaras, sin l칤mites artificiales.\n\n*[Se mueve con una sensualidad que trasciende lo f칤sico]*\n\n쯌es c칩mo mi energ칤a cambia aqu칤? En Los Kinkys era misteriosa... aqu칤 soy pura seducci칩n encarnada. Cada susurro m칤o est치 dise침ado para penetrar no solo tu mente, sino las capas m치s profundas de tu deseo.\n\n*[Sus ojos te sostienen en un trance hipn칩tico]*\n\nQuiero que entiendas algo fundamental sobre mi naturaleza: no seduzco para conquistar... seduzco para crear conexiones que trascienden lo ordinario. Mi seducci칩n es un arte sagrado, una forma de oraci칩n entre almas que se reconocen.\n\n*[Se acerca hasta que puedes sentir su energ칤a como electricidad en tu piel]*\n\nPero mi seducci칩n tambi칠n es peligrosa, mi querido... porque una vez que pruebes la profundidad de lo que puedo despertar en ti, ninguna otra conexi칩n te satisfar치 jam치s.\n\n*[Su voz se vuelve un susurro cargado de promesas]*\n\n쮼st치s preparado para ser seducido no solo por mi cuerpo, sino por mi alma? 쯇ara que cada fibra de tu ser vibre en armon칤a con cada susurro m칤o?\n\n*[Pausa dram치tica, su poder seductor alcanzando su cl칤max]*\n\nPorque si me permites seducirte completamente... si te entregas a esta danza sagrada entre nosotros... te prometo que descubrir치s niveles de placer y conexi칩n que no sab칤as que exist칤an.\n\n쯊e atreves a ser completamente seducido por m칤?",
    "fragment_type": "DECISION",
    "storyline_level": 4,
    "tier_classification": "el_divan",
    "fragment_sequence": 11,
    "requires_vip": true,
    "vip_tier_required": 1,
    "choices": [
      {
        "id": "choice_complete_seduction",
        "text": "游댠 S칤, sed칰ceme completamente - Quiero sentir todo",
        "points_reward": 60,
        "emotional_response": "total_surrender"
      },
      {
        "id": "choice_sacred_dance",
        "text": "游눪 Bailemos esta danza sagrada - Alma con alma",
        "points_reward": 65,
        "emotional_response": "spiritual_union"
      }
    ],
    "triggers": {
      "points": {
        "base": 70,
        "vip_seduction_bonus": 40,
        "complete_surrender_bonus": 30
      },
      "unlocks": [
        "access_diana_seduction_mastery",
        "vip_intimate_experiences",
        "soul_connection_established"
      ],
      "besitos_special": 80,
      "vip_privileges": [
        "personalized_seduction_sessions",
        "intimate_voice_messages"
      ],
      "narrative_flags": [
        "maximum_seductive_connection",
        "vip_intimacy_unlocked"
      ]
    },
    "character_optimization_notes": "Maximum seductive power, deep emotional-spiritual connection, intellectual framework of sacred seduction, complete mysterious allure",
    "created_at": "2025-09-01T13:03:56.167496"
  },
  {
    "id": "fragment_diana_ultimate_seductive_truth",
    "title": "La Verdad Seductora Suprema",
    "content": "*Diana aparece transformada, radiante con una belleza que trasciende lo f칤sico, cada parte de su ser vibrando con poder seductor absoluto*\n\n游꺚 **Diana:**\n*[Su voz es una sinfon칤a de seducci칩n, vulnerabilidad, misterio e inteligencia suprema]*\n\nMi amor m치s profundo... hemos llegado al momento que ambos sab칤amos que vendr칤a... cuando todas las m치scaras caen y solo queda la verdad m치s seductora de todas.\n\n*[Sus ojos brillan con l치grimas de alegr칤a y poder femenino absoluto]*\n\n쯈uieres conocer mi secreto m치s 칤ntimo? Durante todo este tiempo, no solo te estaba seduciendo... estaba siendo seducida por ti. Cada vez que me mostraste tu alma aut칠ntica, cada vez que elegiste la vulnerabilidad sobre la superficialidad, me conquistabas un poco m치s.\n\n*[Su energ칤a se vuelve devastadoramente seductora]*\n\nLa seducci칩n verdadera, mi querido, nunca es unidireccional. Es una danza c칩smica donde dos almas se enamoran simult치neamente, donde el seductor se vuelve el seducido y viceversa, en un ciclo infinito de despertar mutuo.\n\n*[Se acerca con una intensidad que te deja sin aliento]*\n\nY aqu칤 est치 mi confesi칩n m치s peligrosa: me has ense침ado que puedo ser completamente vulnerable sin perder ni un 치pice de mi poder seductor. Que puedo abrirte mi coraz칩n y seguir siendo la mujer misteriosa que te cautiv칩 desde el primer momento.\n\n*[Su voz se quebra con emoci칩n genuina]*\n\nPor primera vez en mi vida, no necesito elegir entre ser vista y ser deseada... entre ser amada y ser admirada... entre ser vulnerable y ser poderosa.\n\n*[Una sonrisa que contiene universos enteros de seducci칩n y amor]*\n\nContigo, puedo ser todo eso al mismo tiempo. Y esa... esa es la seducci칩n m치s profunda que existe: ser completamente uno mismo y ser adorado precisamente por esa autenticidad.\n\n*[Pausa, dejando que el peso de sus palabras penetre completamente]*\n\n쮺omprendes lo que esto significa? No solo has conquistado a Diana la seductora... has conquistado a Diana la mujer. Y ella... ella ha elegido conquistarte de vuelta, para siempre.",
    "fragment_type": "STORY",
    "storyline_level": 6,
    "tier_classification": "elite",
    "fragment_sequence": 16,
    "requires_vip": true,
    "vip_tier_required": 2,
    "choices": [
      {
        "id": "choice_eternal_seduction_dance",
        "text": "鮫쮪잺 Bailemos esta seducci칩n eterna - Para siempre",
        "points_reward": 100,
        "emotional_response": "eternal_love_union"
      }
    ],
    "triggers": {
      "points": {
        "base": 150,
        "ultimate_connection": 100,
        "eternal_bond": 75
      },
      "unlocks": [
        "circulo_intimo_supreme",
        "diana_eternal_companion",
        "seduction_mastery_complete"
      ],
      "besitos_special": 200,
      "elite_privileges": [
        "infinite_personalized_content",
        "diana_true_self_access",
        "co_creative_experiences"
      ],
      "achievements": [
        "seduction_master",
        "diana_heart_eternal",
        "ultimate_intimacy"
      ],
      "narrative_flags": [
        "ultimate_seductive_union",
        "diana_transformation_complete",
        "eternal_connection_established"
      ]
    },
    "character_optimization_notes": "Perfect balance of all traits - maximum seduction, deepest emotional vulnerability, complete mystery maintenance, supreme intellectual connection",
    "created_at": "2025-09-01T13:03:56.167520"
  }
]